examples-results/HsacExamples.SlimTests.HttpTests.HttpPost3UsingFreemarkerTemplateTest.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost3UsingFreemarkerTemplateTest</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.11.3.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost3UsingFreemarkerTemplateTest</h2></header><article><br/><h2>Body from template</h2>
<br/>By using a Freemarker template we can have more dynamic body content.<br/><br/><span class="meta">variable defined: GLOBAL_WEATHER_URL=http://www.webservicex.com/globalweather.asmx</span>
<br/><span class="meta">variable defined: GLOBAL_WEATHER_TEMPLATE_NAME=samplePost.ftl.xml</span>
<br/><br/><h3>Don't send a cityName element: error</h3>
<br/>The Freemarker template will not send a cityName element if no value is supplied (the whole element will be omitted, as can be seen in the request below). The service will not like this.<br/>Omitting the element on a null value could not be done when the body was in the scenario content.<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td colspan="3"><span class="pass">xml http test</span></td>
	</tr>
	<tr class="slimRowColor0">
		<td><span class="pass">template</span></td>
		<td colspan="3">samplePost.ftl.xml</td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td><a href="http://www.webserviceX.NET/GetWeather">http://www.webserviceX.NET/GetWeather</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td>Canada</td>
		<td>for</td>
		<td>countryName</td>
	</tr>
	<tr class="slimRowColor8">
		<td>note</td>
		<td colspan="3">the following 'post' is prefixed with 'reject' as the fixture will return false when a soap fault is returned</td>
	</tr>
	<tr class="slimRowColor7">
		<td><span class="pass">reject</span></td>
		<td>post template to</td>
		<td colspan="2"><a href="http://www.webservicex.com/globalweather.asmx">http://www.webservicex.com/globalweather.asmx</a></td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">500</span></td>
	</tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">request</td>
	<td><pre>&lt;s11:Envelope xmlns:s11=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
    &lt;s11:Body&gt;
        &lt;ns1:GetWeather xmlns:ns1=&quot;http://www.webserviceX.NET&quot;&gt;
            &lt;ns1:CountryName&gt;Canada&lt;/ns1:CountryName&gt;
        &lt;/ns1:GetWeather&gt;
    &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td></tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;soap:Fault&gt;
            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;
            &lt;faultstring&gt;System.Web.Services.Protocols.SoapException: Server was unable to process request. ---&amp;gt; System.Data.SqlClient.SqlException: Procedure or function 'getWeather' expects parameter '@CityName', which was not supplied.
   at System.Data.SqlClient.SqlConnection.OnError(SqlException exception, Boolean breakConnection, Action`1 wrapCloseInAction)
   at System.Data.SqlClient.SqlInternalConnection.OnError(SqlException exception, Boolean breakConnection, Action`1 wrapCloseInAction)
   at System.Data.SqlClient.TdsParser.ThrowExceptionAndWarning(TdsParserStateObject stateObj, Boolean callerHasConnectionLock, Boolean asyncClose)
   at System.Data.SqlClient.TdsParser.TryRun(RunBehavior runBehavior, SqlCommand cmdHandler, SqlDataReader dataStream, BulkCopySimpleResultSet bulkCopyHandler, TdsParserStateObject stateObj, Boolean&amp;amp; dataReady)
   at System.Data.SqlClient.SqlCommand.FinishExecuteReader(SqlDataReader ds, RunBehavior runBehavior, String resetOptionsString)
   at System.Data.SqlClient.SqlCommand.RunExecuteReaderTds(CommandBehavior cmdBehavior, RunBehavior runBehavior, Boolean returnStream, Boolean async, Int32 timeout, Task&amp;amp; task, Boolean asyncWrite, SqlDataReader ds, Boolean describeParameterEncryptionRequest)
   at System.Data.SqlClient.SqlCommand.RunExecuteReader(CommandBehavior cmdBehavior, RunBehavior runBehavior, Boolean returnStream, String method, TaskCompletionSource`1 completion, Int32 timeout, Task&amp;amp; task, Boolean asyncWrite)
   at System.Data.SqlClient.SqlCommand.InternalExecuteNonQuery(TaskCompletionSource`1 completion, String methodName, Boolean sendToPipe, Int32 timeout, Boolean asyncWrite)
   at System.Data.SqlClient.SqlCommand.ExecuteNonQuery()
   at WebServicex.GlobalWeather.GetWeather(String CityName, String CountryName)
   --- End of inner exception stack trace ---&lt;/faultstring&gt;
            &lt;detail/&gt;
        &lt;/soap:Fault&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
</table>
<br/><h3>Send a cityName element: success</h3>
<br/>When a cityName value is set the enclosing element is sent by the Freemarker template (as visible in the shown request content below), and the SOAP call will succeed.<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td colspan="3"><span class="pass">xml http test</span></td>
	</tr>
	<tr class="slimRowColor0">
		<td><span class="pass">template</span></td>
		<td colspan="3">samplePost.ftl.xml</td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td><a href="http://www.webserviceX.NET/GetWeather">http://www.webserviceX.NET/GetWeather</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td>Canada</td>
		<td>for</td>
		<td>countryName</td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td>Vancouver International Air-Port, B. C.</td>
		<td>for</td>
		<td>cityName</td>
	</tr>
	<tr class="slimRowColor5">
		<td><span class="pass">post template to</span></td>
		<td colspan="3"><a href="http://www.webservicex.com/globalweather.asmx">http://www.webservicex.com/globalweather.asmx</a></td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">request</td>
	<td><pre>&lt;s11:Envelope xmlns:s11=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
    &lt;s11:Body&gt;
        &lt;ns1:GetWeather xmlns:ns1=&quot;http://www.webserviceX.NET&quot;&gt;
            &lt;ns1:CityName&gt;Vancouver International Air-Port, B. C.&lt;/ns1:CityName&gt;
            &lt;ns1:CountryName&gt;Canada&lt;/ns1:CountryName&gt;
        &lt;/ns1:GetWeather&gt;
    &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td></tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;GetWeatherResponse xmlns=&quot;http://www.webserviceX.NET&quot;&gt;
            &lt;GetWeatherResult&gt;&amp;lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-16&quot;?&amp;gt;
&amp;lt;CurrentWeather&amp;gt;
  &amp;lt;Location&amp;gt;Vancouver International Air-Port, B. C., Canada (CYVR) 49-11N 123-10W 2M&amp;lt;/Location&amp;gt;
  &amp;lt;Time&amp;gt;Jun 09, 2016 - 06:00 AM EDT / 2016.06.09 1000 UTC&amp;lt;/Time&amp;gt;
  &amp;lt;Wind&amp;gt; from the E (090 degrees) at 8 MPH (7 KT):0&amp;lt;/Wind&amp;gt;
  &amp;lt;Visibility&amp;gt; 20 mile(s):0&amp;lt;/Visibility&amp;gt;
  &amp;lt;SkyConditions&amp;gt; mostly cloudy&amp;lt;/SkyConditions&amp;gt;
  &amp;lt;Temperature&amp;gt; 51 F (11 C)&amp;lt;/Temperature&amp;gt;
  &amp;lt;DewPoint&amp;gt; 44 F (7 C)&amp;lt;/DewPoint&amp;gt;
  &amp;lt;RelativeHumidity&amp;gt; 76%&amp;lt;/RelativeHumidity&amp;gt;
  &amp;lt;Pressure&amp;gt; 29.91 in. Hg (1012 hPa)&amp;lt;/Pressure&amp;gt;
  &amp;lt;Status&amp;gt;Success&amp;lt;/Status&amp;gt;
&amp;lt;/CurrentWeather&amp;gt;&lt;/GetWeatherResult&gt;
        &lt;/GetWeatherResponse&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr class="slimRowColor5">
		<td>register prefix</td>
		<td>wsX</td>
		<td>for namespace</td>
		<td><a href="http://www.webserviceX.NET">http://www.webserviceX.NET</a></td>
	</tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td>xPath</td>
		<td colspan="2">//wsX:GetWeatherResult/text()</td>
	<td>&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;CurrentWeather&gt;
  &lt;Location&gt;Vancouver International Air-Port, B. C., Canada (CYVR) 49-11N 123-10W 2M&lt;/Location&gt;
  &lt;Time&gt;Jun 09, 2016 - 06:00 AM EDT / 2016.06.09 1000 UTC&lt;/Time&gt;
  &lt;Wind&gt; from the E (090 degrees) at 8 MPH (7 KT):0&lt;/Wind&gt;
  &lt;Visibility&gt; 20 mile(s):0&lt;/Visibility&gt;
  &lt;SkyConditions&gt; mostly cloudy&lt;/SkyConditions&gt;
  &lt;Temperature&gt; 51 F (11 C)&lt;/Temperature&gt;
  &lt;DewPoint&gt; 44 F (7 C)&lt;/DewPoint&gt;
  &lt;RelativeHumidity&gt; 76%&lt;/RelativeHumidity&gt;
  &lt;Pressure&gt; 29.91 in. Hg (1012 hPa)&lt;/Pressure&gt;
  &lt;Status&gt;Success&lt;/Status&gt;
&lt;/CurrentWeather&gt;</td></tr>
</table>
</article></body></html>